cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51J19A.svd
        <register>
          <dim>32</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>CHANNEL%s</name>
          <description>Channel n Control</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>EVGEN</name>
              <description>Event Generator Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>PATH</name>
              <description>Path Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PATHSelect</name>
                <enumeratedValue>
                  <name>SYNCHRONOUS</name>
                  <description>Synchronous path</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESYNCHRONIZED</name>
                  <description>Resynchronized path</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCHRONOUS</name>
                  <description>Asynchronous path</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGSEL</name>
              <description>Edge Detection Selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>EDGSELSelect</name>
                <enumeratedValue>
                  <name>NO_EVT_OUTPUT</name>
                  <description>No event output when using the resynchronized or synchronous path</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE</name>
                  <description>Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE</name>
                  <description>Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH_EDGES</name>
                  <description>Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in standby</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>Generic Clock On Demand</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>CHINTENCLR%s</name>
          <description>Channel n Interrupt Enable Clear</description>
          <addressOffset>0x024</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>OVR</name>
              <description>Channel Overrun Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD</name>
              <description>Channel Event Detected Interrupt Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>CHINTENSET%s</name>
          <description>Channel n Interrupt Enable Set</description>
          <addressOffset>0x025</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>OVR</name>
              <description>Channel Overrun Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD</name>
              <description>Channel Event Detected Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>CHINTFLAG%s</name>
          <description>Channel n Interrupt Flag Status and Clear</description>
          <addressOffset>0x026</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>OVR</name>
              <description>Channel Overrun</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVD</name>
              <description>Channel Event Detected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>CHSTATUS%s</name>
          <description>Channel n Status</description>
          <addressOffset>0x027</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x01</resetValue>
          <fields>
            <field>
              <name>RDYUSR</name>
              <description>Ready User</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSYCH</name>
              <description>Busy Channel</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>67</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>USER%s</name>
          <description>User Multiplexer n</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHANNEL</name>
              <description>Channel Event Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
