cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51J19A.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PM</name>
      <version>1.0.0</version>
      <description>Power Manager</description>
      <groupName>PM</groupName>
      <prependToName>PM_</prependToName>
      <baseAddress>0x40000400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PM</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>IORET</name>
              <description>I/O Retention</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEPCFG</name>
          <description>Sleep Configuration</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <resetValue>0x02</resetValue>
          <fields>
            <field>
              <name>SLEEPMODE</name>
              <description>Sleep Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SLEEPMODESelect</name>
                <enumeratedValue>
                  <name>IDLE0</name>
                  <description>CPU clock is OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE1</name>
                  <description>AHB clock is OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE2</name>
                  <description>APB clock are OFF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <description>All Clocks are OFF</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIBERNATE</name>
                  <description>Backup domain is ON as well as some PDRAMs</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BACKUP</name>
                  <description>Only Backup domain is powered ON</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>All power domains are powered OFF</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SLEEPRDY</name>
              <description>Sleep Mode Entry Ready Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SLEEPRDY</name>
              <description>Sleep Mode Entry Ready Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x06</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SLEEPRDY</name>
              <description>Sleep Mode Entry Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STDBYCFG</name>
          <description>Standby Configuration</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RAMCFG</name>
              <description>Ram Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>RAMCFGSelect</name>
                <enumeratedValue>
                  <name>RET</name>
                  <description>All the RAMs are retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTIAL</name>
                  <description>Only the first 32K bytes are retained</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>All the RAMs are OFF</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FASTWKUP</name>
              <description>Fast Wakeup</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HIBCFG</name>
          <description>Hibernate Configuration</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RAMCFG</name>
              <description>Ram Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BRAMCFG</name>
              <description>Backup Ram Configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKUPCFG</name>
          <description>Backup Configuration</description>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>BRAMCFG</name>
              <description>Ram Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWSAKDLY</name>
          <description>Power Switch Acknowledge Delay</description>
          <addressOffset>0x12</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DLYVAL</name>
              <description>Delay Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>IGNACK</name>
              <description>Ignore Acknowledge</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
