cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51J19A.svd
        <register>
          <dim>2</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>ALARM%s</name>
          <description>MODE2 Alarm n Value</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SECOND</name>
              <description>Second</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>MINUTE</name>
              <description>Minute</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>HOUR</name>
              <description>Hour</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>HOURSelect</name>
                <enumeratedValue>
                  <name>AM</name>
                  <description>Morning hour</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PM</name>
                  <description>Afternoon hour</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAY</name>
              <description>Day</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>MONTH</name>
              <description>Month</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>YEAR</name>
              <description>Year</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>MASK%s</name>
          <description>MODE2 Alarm n Mask</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Alarm Mask Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SELSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Alarm Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SS</name>
                  <description>Match seconds only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MMSS</name>
                  <description>Match seconds and minutes only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HHMMSS</name>
                  <description>Match seconds, minutes, and hours only</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDHHMMSS</name>
                  <description>Match seconds, minutes, hours, and days only</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MMDDHHMMSS</name>
                  <description>Match seconds, minutes, hours, days, and months only</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YYMMDDHHMMSS</name>
                  <description>Match seconds, minutes, hours, days, months, and years</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GP%s</name>
          <description>General Purpose</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GP</name>
              <description>General Purpose</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMPCTRL</name>
          <description>Tamper Control</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN0ACT</name>
              <description>Tamper Input 0 Action</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>IN0ACTSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off (Disabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKE</name>
                  <description>Wake without timestamp</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <description>Capture timestamp</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTL</name>
                  <description>Compare IN0 to OUT</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN1ACT</name>
              <description>Tamper Input 1 Action</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>IN1ACTSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off (Disabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKE</name>
                  <description>Wake without timestamp</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <description>Capture timestamp</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTL</name>
                  <description>Compare IN1 to OUT</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN2ACT</name>
              <description>Tamper Input 2 Action</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>IN2ACTSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off (Disabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKE</name>
                  <description>Wake without timestamp</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <description>Capture timestamp</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTL</name>
                  <description>Compare IN2 to OUT</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN3ACT</name>
              <description>Tamper Input 3 Action</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>IN3ACTSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off (Disabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKE</name>
                  <description>Wake without timestamp</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <description>Capture timestamp</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTL</name>
                  <description>Compare IN3 to OUT</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN4ACT</name>
              <description>Tamper Input 4 Action</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>IN4ACTSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off (Disabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKE</name>
                  <description>Wake without timestamp</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <description>Capture timestamp</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTL</name>
                  <description>Compare IN4 to OUT</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAMLVL0</name>
              <description>Tamper Level Select 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMLVL1</name>
              <description>Tamper Level Select 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMLVL2</name>
              <description>Tamper Level Select 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMLVL3</name>
              <description>Tamper Level Select 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMLVL4</name>
              <description>Tamper Level Select 4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEBNC0</name>
              <description>Debouncer Enable 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEBNC1</name>
              <description>Debouncer Enable 1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEBNC2</name>
              <description>Debouncer Enable 2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEBNC3</name>
              <description>Debouncer Enable 3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEBNC4</name>
              <description>Debouncer Enable 4</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMESTAMP</name>
          <description>MODE2 Timestamp</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SECOND</name>
              <description>Second Timestamp Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINUTE</name>
              <description>Minute Timestamp Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HOUR</name>
              <description>Hour Timestamp Value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>HOURSelect</name>
                <enumeratedValue>
                  <name>AM</name>
                  <description>AM when CLKREP in 12-hour</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PM</name>
                  <description>PM when CLKREP in 12-hour</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAY</name>
              <description>Day Timestamp Value</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MONTH</name>
              <description>Month Timestamp Value</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>YEAR</name>
              <description>Year Timestamp Value</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMPID</name>
          <description>Tamper ID</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TAMPID0</name>
              <description>Tamper Input 0 Detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMPID1</name>
              <description>Tamper Input 1 Detected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMPID2</name>
              <description>Tamper Input 2 Detected</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMPID3</name>
              <description>Tamper Input 3 Detected</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMPID4</name>
              <description>Tamper Input 4 Detected</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMPEVT</name>
              <description>Tamper Event Detected</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>BKUP%s</name>
          <description>Backup</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BKUP</name>
              <description>Backup</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
       </cluster> <!-- RtcMode2 -->
      </registers>
    </peripheral>
    <peripheral>
      <name>SDHC0</name>
      <version>1.8.3</version>
      <description>SD/MMC Host Controller</description>
      <groupName>SDHC</groupName>
      <prependToName>SDHC_</prependToName>
      <baseAddress>0x45000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000C00</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SDHC0</name>
        <value>135</value>
      </interrupt>
      <registers>
        <register>
          <name>SSAR</name>
          <description>SDMA System Address / Argument 2</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>SDMA System Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SSAR_CMD23</name>
          <description>SDMA System Address / Argument 2</description>
          <alternateRegister>SSAR</alternateRegister>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ARG2</name>
              <description>Argument 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BSR</name>
          <description>Block Size</description>
          <addressOffset>0x004</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>BLOCKSIZE</name>
              <description>Transfer Block Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>BOUNDARY</name>
              <description>SDMA Buffer Boundary</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>BOUNDARYSelect</name>
                <enumeratedValue>
                  <name>4K</name>
                  <description>4k bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8K</name>
                  <description>8k bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16K</name>
                  <description>16k bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32K</name>
                  <description>32k bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64K</name>
                  <description>64k bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128K</name>
                  <description>128k bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256K</name>
                  <description>256k bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512K</name>
                  <description>512k bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BCR</name>
          <description>Block Count</description>
          <addressOffset>0x006</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>BCNT</name>
              <description>Blocks Count for Current Transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ARG1R</name>
          <description>Argument 1</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ARG</name>
              <description>Argument 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
