cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51J19A.svd
        <register>
          <name>TMR</name>
          <description>Transfer Mode</description>
          <addressOffset>0x00C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DMAEN</name>
              <description>DMA Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DMAENSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No data transfer or Non DMA data transfer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>DMA data transfer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCEN</name>
              <description>Block Count Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BCENSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMDEN</name>
              <description>Auto Command Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ACMDENSelect</name>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Auto Command Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD12</name>
                  <description>Auto CMD12 Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD23</name>
                  <description>Auto CMD23 Enable</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTDSEL</name>
              <description>Data Transfer Direction Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DTDSELSelect</name>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write (Host to Card)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read (Card to Host)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSBSEL</name>
              <description>Multi/Single Block Selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MSBSELSelect</name>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single Block</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTIPLE</name>
                  <description>Multiple Block</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Command</description>
          <addressOffset>0x00E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>RESPTYP</name>
              <description>Response Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>RESPTYPSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No response</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>136_BIT</name>
                  <description>136-bit response</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48_BIT</name>
                  <description>48-bit response</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48_BIT_BUSY</name>
                  <description>48-bit response check busy after response</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDCCEN</name>
              <description>Command CRC Check Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMDCCENSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDICEN</name>
              <description>Command Index Check Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMDICENSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPSEL</name>
              <description>Data Present Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DPSELSelect</name>
                <enumeratedValue>
                  <name>NO_DATA</name>
                  <description>No Data Present</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA</name>
                  <description>Data Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDTYP</name>
              <description>Command Type</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CMDTYPSelect</name>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Other commands</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPEND</name>
                  <description>CMD52 for writing Bus Suspend in CCCR</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESUME</name>
                  <description>CMD52 for writing Function Select in CCCR</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABORT</name>
                  <description>CMD12, CMD52 for writing I/O Abort in CCCR</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDIDX</name>
              <description>Command Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RR%s</name>
          <description>Response</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CMDRESP</name>
              <description>Command Response</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDPR</name>
          <description>Buffer Data Port</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUFDATA</name>
              <description>Buffer Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PSR</name>
          <description>Present State</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00F80000</resetValue>
          <fields>
            <field>
              <name>CMDINHC</name>
              <description>Command Inhibit (CMD)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMDINHCSelect</name>
                <enumeratedValue>
                  <name>CAN</name>
                  <description>Can issue command using only CMD line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CANNOT</name>
                  <description>Cannot issue command</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDINHD</name>
              <description>Command Inhibit (DAT)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMDINHDSelect</name>
                <enumeratedValue>
                  <name>CAN</name>
                  <description>Can issue command which uses the DAT line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CANNOT</name>
                  <description>Cannot issue command which uses the DAT line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLACT</name>
              <description>DAT Line Active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DLACTSelect</name>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>DAT Line Inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>DAT Line Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTREQ</name>
              <description>Re-Tuning Request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RTREQSelect</name>
                <enumeratedValue>
                  <name>OK</name>
                  <description>Fixed or well-tuned sampling clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUIRED</name>
                  <description>Sampling clock needs re-tuning</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WTACT</name>
              <description>Write Transfer Active</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WTACTSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No valid data</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Transferring data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTACT</name>
              <description>Read Transfer Active</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RTACTSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No valid data</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Transferring data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUFWREN</name>
              <description>Buffer Write Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BUFWRENSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Write disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Write enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUFRDEN</name>
              <description>Buffer Read Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BUFRDENSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Read disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Read enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CARDINS</name>
              <description>Card Inserted</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CARDINSSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Reset or Debouncing or No Card</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Card inserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CARDSS</name>
              <description>Card State Stable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CARDSSSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Reset or Debouncing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>No Card or Insered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CARDDPL</name>
              <description>Card Detect Pin Level</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CARDDPLSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No card present (SDCD#=1)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Card present (SDCD#=0)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRPPL</name>
              <description>Write Protect Pin Level</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WRPPLSelect</name>
                <enumeratedValue>
                  <name>PROTECTED</name>
                  <description>Write protected (SDWP#=0)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write enabled (SDWP#=1)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATLL</name>
              <description>DAT[3:0] Line Level</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CMDLL</name>
              <description>CMD Line Level</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
