cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51J19A.svd
        <register>
          <name>HC1R</name>
          <description>Host Control 1</description>
          <addressOffset>0x028</addressOffset>
          <size>8</size>
          <resetValue>0xE00</resetValue>
          <fields>
            <field>
              <name>LEDCTRL</name>
              <description>LED Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LEDCTRLSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>LED off</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>LED on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DW</name>
              <description>Data Width</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DWSelect</name>
                <enumeratedValue>
                  <name>1BIT</name>
                  <description>1-bit mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4BIT</name>
                  <description>4-bit mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSEN</name>
              <description>High Speed Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>HSENSelect</name>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Speed mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Speed mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMASEL</name>
              <description>DMA Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DMASELSelect</name>
                <enumeratedValue>
                  <name>SDMA</name>
                  <description>SDMA is selected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BIT</name>
                  <description>32-bit Address ADMA2 is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CARDDTL</name>
              <description>Card Detect Test Level</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CARDDTLSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Card</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Card Inserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CARDDSEL</name>
              <description>Card Detect Signal Selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CARDDSELSelect</name>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>SDCD# is selected (for normal use)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST</name>
                  <description>The Card Select Test Level is selected (for test purpose)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HC1R_EMMC</name>
          <description>Host Control 1</description>
          <alternateRegister>HC1R</alternateRegister>
          <addressOffset>0x028</addressOffset>
          <size>8</size>
          <resetValue>0xE00</resetValue>
          <fields>
            <field>
              <name>DW</name>
              <description>Data Width</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DWSelect</name>
                <enumeratedValue>
                  <name>1BIT</name>
                  <description>1-bit mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4BIT</name>
                  <description>4-bit mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSEN</name>
              <description>High Speed Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>HSENSelect</name>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Speed mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Speed mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMASEL</name>
              <description>DMA Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DMASELSelect</name>
                <enumeratedValue>
                  <name>SDMA</name>
                  <description>SDMA is selected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BIT</name>
                  <description>32-bit Address ADMA2 is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR</name>
          <description>Power Control</description>
          <addressOffset>0x029</addressOffset>
          <size>8</size>
          <resetValue>0x0E</resetValue>
          <fields>
            <field>
              <name>SDBPWR</name>
              <description>SD Bus Power</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SDBPWRSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Power off</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Power on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDBVSEL</name>
              <description>SD Bus Voltage Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SDBVSELSelect</name>
                <enumeratedValue>
                  <name>1V8</name>
                  <description>1.8V (Typ.)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3V0</name>
                  <description>3.0V (Typ.)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3V3</name>
                  <description>3.3V (Typ.)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BGCR</name>
          <description>Block Gap Control</description>
          <addressOffset>0x02A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>STPBGR</name>
              <description>Stop at Block Gap Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>STPBGRSelect</name>
                <enumeratedValue>
                  <name>TRANSFER</name>
                  <description>Transfer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONTR</name>
              <description>Continue Request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CONTRSelect</name>
                <enumeratedValue>
                  <name>GO_ON</name>
                  <description>Not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESTART</name>
                  <description>Restart</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWCTRL</name>
              <description>Read Wait Control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RWCTRLSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable Read Wait Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable Read Wait Control</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTBG</name>
              <description>Interrupt at Block Gap</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>INTBGSelect</name>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BGCR_EMMC</name>
          <description>Block Gap Control</description>
          <alternateRegister>BGCR</alternateRegister>
          <addressOffset>0x02A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>STPBGR</name>
              <description>Stop at Block Gap Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>STPBGRSelect</name>
                <enumeratedValue>
                  <name>TRANSFER</name>
                  <description>Transfer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONTR</name>
              <description>Continue Request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CONTRSelect</name>
                <enumeratedValue>
                  <name>GO_ON</name>
                  <description>Not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESTART</name>
                  <description>Restart</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WCR</name>
          <description>Wakeup Control</description>
          <addressOffset>0x02B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>WKENCINT</name>
              <description>Wakeup Event Enable on Card Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WKENCINTSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKENCINS</name>
              <description>Wakeup Event Enable on Card Insertion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WKENCINSSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKENCREM</name>
              <description>Wakeup Event Enable on Card Removal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WKENCREMSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>Clock Control</description>
          <addressOffset>0x02C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>INTCLKEN</name>
              <description>Internal Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>INTCLKENSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Stop</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Oscillate</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTCLKS</name>
              <description>Internal Clock Stable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>INTCLKSSelect</name>
                <enumeratedValue>
                  <name>NOT_READY</name>
                  <description>Not Ready</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>Ready</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDCLKEN</name>
              <description>SD Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SDCLKENSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKGSEL</name>
              <description>Clock Generator Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CLKGSELSelect</name>
                <enumeratedValue>
                  <name>DIV</name>
                  <description>Divided Clock Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG</name>
                  <description>Programmable Clock Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USDCLKFSEL</name>
              <description>Upper Bits of SDCLK Frequency Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SDCLKFSEL</name>
              <description>SDCLK Frequency Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR</name>
          <description>Timeout Control</description>
          <addressOffset>0x02E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DTCVAL</name>
              <description>Data Timeout Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRR</name>
          <description>Software Reset</description>
          <addressOffset>0x02F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRSTALL</name>
              <description>Software Reset For All</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SWRSTALLSelect</name>
                <enumeratedValue>
                  <name>WORK</name>
                  <description>Work</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRSTCMD</name>
              <description>Software Reset For CMD Line</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SWRSTCMDSelect</name>
                <enumeratedValue>
                  <name>WORK</name>
                  <description>Work</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRSTDAT</name>
              <description>Software Reset For DAT Line</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SWRSTDATSelect</name>
                <enumeratedValue>
                  <name>WORK</name>
                  <description>Work</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
