cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51J19A.svd
        <register>
          <name>ACESR</name>
          <description>Auto CMD Error Status</description>
          <addressOffset>0x03C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ACMD12NE</name>
              <description>Auto CMD12 Not Executed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>ACMD12NESelect</name>
                <enumeratedValue>
                  <name>EXEC</name>
                  <description>Executed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_EXEC</name>
                  <description>Not executed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMDTEO</name>
              <description>Auto CMD Timeout Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>ACMDTEOSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Timeout</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMDCRC</name>
              <description>Auto CMD CRC Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>ACMDCRCSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>CRC Error Generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMDEND</name>
              <description>Auto CMD End Bit Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>ACMDENDSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>End Bit Error Generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMDIDX</name>
              <description>Auto CMD Index Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>ACMDIDXSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDNI</name>
              <description>Command not Issued By Auto CMD12 Error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>CMDNISelect</name>
                <enumeratedValue>
                  <name>OK</name>
                  <description>No error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_ISSUED</name>
                  <description>Not Issued</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HC2R</name>
          <description>Host Control 2</description>
          <addressOffset>0x03E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>UHSMS</name>
              <description>UHS Mode Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>UHSMSSelect</name>
                <enumeratedValue>
                  <name>SDR12</name>
                  <description>SDR12</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR25</name>
                  <description>SDR25</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR50</name>
                  <description>SDR50</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR104</name>
                  <description>SDR104</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR50</name>
                  <description>DDR50</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VS18EN</name>
              <description>1.8V Signaling Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>VS18ENSelect</name>
                <enumeratedValue>
                  <name>S33V</name>
                  <description>3.3V Signaling</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S18V</name>
                  <description>1.8V Signaling</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRVSEL</name>
              <description>Driver Strength Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DRVSELSelect</name>
                <enumeratedValue>
                  <name>B</name>
                  <description>Driver Type B is Selected (Default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>Driver Type A is Selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>Driver Type C is Selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Driver Type D is Selected</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTUN</name>
              <description>Execute Tuning</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EXTUNSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Not Tuned or Tuning Completed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUESTED</name>
                  <description>Execute Tuning</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLCKSEL</name>
              <description>Sampling Clock Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SLCKSELSelect</name>
                <enumeratedValue>
                  <name>FIXED</name>
                  <description>Fixed clock is used to sample data</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TUNED</name>
                  <description>Tuned clock is used to sample data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASINTEN</name>
              <description>Asynchronous Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ASINTENSelect</name>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVALEN</name>
              <description>Preset Value Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PVALENSelect</name>
                <enumeratedValue>
                  <name>HOST</name>
                  <description>SDCLK and Driver Strength are controlled by Host Controller</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Automatic Selection by Preset Value is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HC2R_EMMC</name>
          <description>Host Control 2</description>
          <alternateRegister>HC2R</alternateRegister>
          <addressOffset>0x03E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>HS200EN</name>
              <description>HS200 Mode Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>HS200ENSelect</name>
                <enumeratedValue>
                  <name>SDR12</name>
                  <description>SDR12</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR25</name>
                  <description>SDR25</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR50</name>
                  <description>SDR50</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR104</name>
                  <description>SDR104</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR50</name>
                  <description>DDR50</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRVSEL</name>
              <description>Driver Strength Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DRVSELSelect</name>
                <enumeratedValue>
                  <name>B</name>
                  <description>Driver Type B is Selected (Default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>Driver Type A is Selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>Driver Type C is Selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Driver Type D is Selected</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTUN</name>
              <description>Execute Tuning</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EXTUNSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Not Tuned or Tuning Completed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUESTED</name>
                  <description>Execute Tuning</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLCKSEL</name>
              <description>Sampling Clock Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SLCKSELSelect</name>
                <enumeratedValue>
                  <name>FIXED</name>
                  <description>Fixed clock is used to sample data</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TUNED</name>
                  <description>Tuned clock is used to sample data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVALEN</name>
              <description>Preset Value Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PVALENSelect</name>
                <enumeratedValue>
                  <name>HOST</name>
                  <description>SDCLK and Driver Strength are controlled by Host Controller</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Automatic Selection by Preset Value is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
